Autodesk.Revit.DB.IFC.IFCImportAction
The action of the IFC import.
Since:
2015

Autodesk.Revit.DB.IFC.IFCImportAction.Link
Link into an existing project file.

Autodesk.Revit.DB.IFC.IFCImportAction.Open
Open a new project file.